#Home Work
#1) Попросите пользователя ввести произвольную строку.
#2) Создайте кортеж, состоящий из символов, введённой пользователем строки.
#3) Выведите кортеж, используя цикл for.

car=tuple(input("Введите произльную фразу"))
for x in car:
    print(x)

exit()
cart=tuple()
mytuple=(1,'4','3',5)
print(mytuple)

mytuple=(1,)
print(mytuple)
mytuple=(1,'4','3',5)
print(mytuple[1])
#mytuple[1]=5#ошибка

mytuple=tuple("helloy")
print(mytuple)
