#1) Создайте словарь с двумя ключами «Name» и «Age» и значениями «Без имени» и «-1».
#2) Попросите пользователя ввести своё имя.
#3) Попросите пользователя ввести свой возраст.
#4) Примите эти данные и измените соответствующие элементы словаря.
#5) Выведите этот словарь (ключи и значения), используя цикл for.
di=dict(Name="Без имени", Age='-1')

na=input("Введите имя")
ag=input("введите возраст")
di["Name"]=na
di["Age"]=ag
for k in di:
    print(di[k])




exit()
x=dict()
x={"имя":"вася","age":35}

print(x)
x=dict(имя='вася',age=35)
print(x)
print(x["age"])

print("-------------")

for key in x:
    print(key,"=",x[key])

tup=("имя","age")
for k in tup:
    print(k,x[k])

print("-------------")

di={str( i*2):i for i in range(1,10)}

print(di)