#1) Создайте список из 5 чисел.
#2) Напишите функцию, которая находит все отрицательные числа и выводит их.
#3) С помощью отладки пройдите все шаги выполнения программы, анализируя значения всех переменных.


l=[10,-4,-1,0,5,2,-2]
k=0
for k in l:
    if k<0:
        print(k)








exit()
a=0
while True:
    a=a+0.1
    if a==1:
        exit(0)
    print("Helloy")
